WS-I/BP1.2/Messages/BaseDataTypes/XmlFormatter/DocLitW/SoapWsdl.BaseDataTypes.XmlFormatter.DocLitWrapped_RetLong_Client_Request-1.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <a:Action s:mustUnderstand="1">http://tempuri.org/IBaseDataTypesDocLitW/RetLong</a:Action>
    <a:MessageID>urn:uuid:c18f5ae9-0ed8-42ef-a116-1455e61fc4bf</a:MessageID>
    <a:ReplyTo>
      <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
    </a:ReplyTo>
  </s:Header>
  <s:Body>
    <RetLong xmlns="http://tempuri.org/">
      <inLong>9223372036854775807</inLong>
    </RetLong>
  </s:Body>
</s:Envelope>